package com.javarush.test.level12.lesson04.task03;

/* Пять методов print с разными параметрами
Написать пять методов print с разными параметрами.
*/

public class Solution
{
    public static void main(String[] args)
    {

    }

    //Напишите тут ваши методы
    void print(int a){
        System.out.println(a);
    }

    void print(Integer a){
        System.out.println(a);
    }

    void print(String  a){
        System.out.println(a);
    }

    void print(Short a){
        System.out.println(a);
    }

    void print(Byte a){
        System.out.println(a);
    }
}
