package com.javarush.test.level08.lesson11.home03;

import java.util.HashMap;
import java.util.Map;

/* Люди с одинаковыми именами и/или фамилиями
1. Создать словарь Map (<String, String>) и добавить туда 10 человек в виде «Фамилия»-«Имя».
2. Пусть среди этих 10 человек есть люди с одинаковыми именами.
3. Пусть среди этих 10 человек есть люди с одинаковыми фамилиями.
4. Вывести содержимое Map на экран.
*/

public class Solution
{
    public static void main(String[] args)
    {
        Map<String, String> map = createPeopleList();
        printPeopleList(map);
    }

    public static Map<String, String> createPeopleList()
    {
        HashMap<String,String> dictionary = new HashMap<String, String>();
        dictionary.put("f1","name1");
        dictionary.put("f2","name");
        dictionary.put("f1","name1");
        dictionary.put("f4","name");
        dictionary.put("f5","name2");
        dictionary.put("f5","name2");
        dictionary.put("f7","name3");
        dictionary.put("f8","name4");
        dictionary.put("f9","name5");
        dictionary.put("f10","name6");

        return dictionary;
    }

    public static void printPeopleList(Map<String, String> map)
    {
        for (Map.Entry<String, String> s : map.entrySet())
        {
            System.out.println(s.getKey() + " " + s.getValue());
        }
    }

}
